       program-id. Program1 as "schultzder_sandovala_ProjectPart2.Program1".

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program Program1.
